# Processo de ETL 
Os dados utilizados foram gerados pelo ChatGPT como forma de aprendizado

In [1]:
import pandas as pd
from datetime import datetime

## Extract

In [2]:
df = pd.read_csv("lista.csv")
df

   ID_Venda  Data_Venda Cliente    Produto  Valor
0         1  2023-08-01    João  Produto A    100
1         2  2023-08-02   Maria  Produto B    150
2         3  2023-08-03  Carlos  Produto A    120
3         4  2023-08-03     Ana  Produto C    200
4         5  2023-08-04    João  Produto B    130
5         6  2023-08-05   Laura  Produto A    110
6         7  2023-08-06   Maria  Produto C    180
7         8  2023-08-06    João  Produto A     90
8         9  2023-08-07  Carlos  Produto B    160
9        10  2023-08-07     Ana  Produto A    140

## Transform

In [3]:
df.dtypes

ID_Venda       int64
Data_Venda    object
Cliente       object
Produto       object
Valor          int64
dtype: object

In [4]:
df['Data_Venda'] = pd.to_datetime(df['Data_Venda'], format='%y-%m-%d', infer_datetime_format=True)

In [5]:
## Contando clientes

In [6]:
df['Cliente'].groupby(df['Cliente']).count()

Cliente
Ana       2
Carlos    2
João      3
Laura     1
Maria     2
Name: Cliente, dtype: int64

In [7]:
df_2 = pd.DataFrame()
df_2['Cliente'] = df['Cliente'].sort_values().unique()
df_2['Valor_gasto'] = df['Valor'].groupby(df['Cliente']).sum().to_list()

In [8]:
df_2

  Cliente  Valor_gasto
0     Ana          340
1  Carlos          280
2    João          320
3   Laura          110
4   Maria          330

## Load

In [9]:
df_transf = df_2.to_csv('Dados_transform.csv', index=False)
df_transf